---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarCouplerFailures.NoBarSizeWarning
source: html/2dd57241-1e01-291c-52ec-1c279fbbfa2a.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarCouplerFailures.NoBarSizeWarning Property

This is used to post warning. At least Bar Size 1 or Bar Size 2 should have a value other than "None".

## Syntax (C#)
```csharp
public static FailureDefinitionId NoBarSizeWarning { get; }
```